

    io_lib:format的格式化参数

1. ~c 输出字符

    输出字符

    1> io_lib:format("~c", "a").
    ["a"]

    输出字符两遍

    2> io_lib:format("~2c", "a").
    ["aa"]

    输出字符串长度为2 , 不足左边补空格

    3> io_lib:format("~2.1c", "a").
    [[" ",97]]   %" a"

    输出字符串长度为2 , 不足右边补空格

    4>  io_lib:format("~-2.1c", "a").
    [["a",32]]   %"a "

2. ~s 打印字符串

1> io_lib:format("~s ~s", ["Hello", "World"]).
["Hello",32,"World"]   %"Hello World"

3. ~w , ~p 标准输出 , 支持term , w会对输出的数据做一些分行处理 , p显示在一行

1> io_lib:format("~p", [{name, "World"}]).
[[123,["name",44,"\"World\""],125]]   %"{name,\"World\"}"
2> io_lib:format("~w", [{name, "World"}]).
[[123,
  ["name",44,
   [91,["87",44,"111",44,"114",44,"108",44,"100"],93]],
  125]]

4. 指定字符宽度与填补字符

1> io_lib:format("~2.10.0B",[2]).
[["0",50]]   %"02"
1> io_lib:format("~4.10.0B-~2.10.0B-~2.10.0B",[2017,3,15]).
["2017",45,["0",51],45,"15"]   %"2017-03-15"
